zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW45B41Z82/iar/startup_KW45B41Z82.s
        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B .

        PUBWEAK SecureFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SecureFault_Handler
        B .

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B .

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B .

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B .

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B .

        PUBWEAK CTI_IRQHandler
        PUBWEAK CMC0_IRQHandler
        PUBWEAK DMA0_CH0_IRQHandler
        PUBWEAK DMA0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH0_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH1_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH2_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH3_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH4_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH5_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH6_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH7_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH8_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH8_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH9_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH9_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH10_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH11_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH11_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH12_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH12_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH13_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH13_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH14_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH14_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH15_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH15_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK EWM0_IRQHandler
        PUBWEAK MCM0_IRQHandler
        PUBWEAK MSCM0_IRQHandler
        PUBWEAK SPC0_IRQHandler
        PUBWEAK WUU0_IRQHandler
        PUBWEAK WDOG0_IRQHandler
        PUBWEAK WDOG1_IRQHandler
        PUBWEAK SCG0_IRQHandler
        PUBWEAK SFA0_IRQHandler
        PUBWEAK SFA0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SFA0_IRQHandler
        LDR     R0, =SFA0_DriverIRQHandler
        BX      R0

        PUBWEAK FMU0_IRQHandler
        PUBWEAK ELE_CMD_IRQHandler
        PUBWEAK ELE_SECURE_IRQHandler
        PUBWEAK ELE_NONSECURE_IRQHandler
        PUBWEAK TRDC0_IRQHandler
        PUBWEAK RTC_Alarm_IRQHandler
        PUBWEAK RTC_Seconds_IRQHandler
        PUBWEAK LPTMR0_IRQHandler
        PUBWEAK LPTMR1_IRQHandler
        PUBWEAK LPIT0_IRQHandler
        PUBWEAK TPM0_IRQHandler
        PUBWEAK TPM1_IRQHandler
        PUBWEAK LPI2C0_IRQHandler
        PUBWEAK LPI2C0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C0_IRQHandler
        LDR     R0, =LPI2C0_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C1_IRQHandler
        PUBWEAK LPI2C1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C1_IRQHandler
        LDR     R0, =LPI2C1_DriverIRQHandler
        BX      R0

        PUBWEAK I3C0_IRQHandler
        PUBWEAK I3C0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C0_IRQHandler
        LDR     R0, =I3C0_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI0_IRQHandler
        PUBWEAK LPSPI0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI0_IRQHandler
        LDR     R0, =LPSPI0_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI1_IRQHandler
        PUBWEAK LPSPI1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI1_IRQHandler
        LDR     R0, =LPSPI1_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART0_IRQHandler
        PUBWEAK LPUART0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART0_IRQHandler
        LDR     R0, =LPUART0_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART1_IRQHandler
        PUBWEAK LPUART1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART1_IRQHandler
        LDR     R0, =LPUART1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXIO0_IRQHandler
        PUBWEAK FLEXIO0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO0_IRQHandler
        LDR     R0, =FLEXIO0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved63_IRQHandler
        PUBWEAK RF_IMU0_IRQHandler
        PUBWEAK RF_IMU1_IRQHandler
        PUBWEAK RF_NBU_IRQHandler
        PUBWEAK RF_FMU_IRQHandler
        PUBWEAK RF_WOR_IRQHandler
        PUBWEAK Reserved69_IRQHandler
        PUBWEAK RF_Generic_IRQHandler
        PUBWEAK RF_BRIC_IRQHandler
        PUBWEAK RF_LANT_SW_IRQHandler
        PUBWEAK RFMC_IRQHandler
        PUBWEAK DSB_IRQHandler
        PUBWEAK GPIOA_INT0_IRQHandler
        PUBWEAK GPIOA_INT1_IRQHandler
        PUBWEAK GPIOB_INT0_IRQHandler
        PUBWEAK GPIOB_INT1_IRQHandler
        PUBWEAK GPIOC_INT0_IRQHandler
        PUBWEAK GPIOC_INT1_IRQHandler
        PUBWEAK GPIOD_INT0_IRQHandler
        PUBWEAK GPIOD_INT1_IRQHandler
        PUBWEAK PORTA_EFT_IRQHandler
        PUBWEAK PORTB_EFT_IRQHandler
        PUBWEAK PORTC_EFT_IRQHandler
        PUBWEAK PORTD_EFT_IRQHandler
        PUBWEAK ADC0_IRQHandler
        PUBWEAK LPCMP0_IRQHandler
        PUBWEAK LPCMP1_IRQHandler
        PUBWEAK VBAT_IRQHandler
        PUBWEAK Reserved91_IRQHandler
        PUBWEAK DefaultISR
        SECTION .text:CODE:REORDER:NOROOT(1)
CTI_IRQHandler
CMC0_IRQHandler
DMA0_DriverIRQHandler
EWM0_IRQHandler
MCM0_IRQHandler
MSCM0_IRQHandler
SPC0_IRQHandler
WUU0_IRQHandler
WDOG0_IRQHandler
WDOG1_IRQHandler
SCG0_IRQHandler
SFA0_DriverIRQHandler
FMU0_IRQHandler
ELE_CMD_IRQHandler
ELE_SECURE_IRQHandler
ELE_NONSECURE_IRQHandler
TRDC0_IRQHandler
RTC_Alarm_IRQHandler
RTC_Seconds_IRQHandler
LPTMR0_IRQHandler
LPTMR1_IRQHandler
LPIT0_IRQHandler
TPM0_IRQHandler
TPM1_IRQHandler
LPI2C0_DriverIRQHandler
LPI2C1_DriverIRQHandler
I3C0_DriverIRQHandler
LPSPI0_DriverIRQHandler
LPSPI1_DriverIRQHandler
LPUART0_DriverIRQHandler
LPUART1_DriverIRQHandler
FLEXIO0_DriverIRQHandler
Reserved63_IRQHandler
RF_IMU0_IRQHandler
RF_IMU1_IRQHandler
RF_NBU_IRQHandler
RF_FMU_IRQHandler
RF_WOR_IRQHandler
Reserved69_IRQHandler
RF_Generic_IRQHandler
RF_BRIC_IRQHandler
RF_LANT_SW_IRQHandler
RFMC_IRQHandler
DSB_IRQHandler
GPIOA_INT0_IRQHandler
GPIOA_INT1_IRQHandler
GPIOB_INT0_IRQHandler
GPIOB_INT1_IRQHandler
GPIOC_INT0_IRQHandler
GPIOC_INT1_IRQHandler
GPIOD_INT0_IRQHandler
GPIOD_INT1_IRQHandler
PORTA_EFT_IRQHandler
PORTB_EFT_IRQHandler
PORTC_EFT_IRQHandler
PORTD_EFT_IRQHandler
ADC0_IRQHandler
LPCMP0_IRQHandler
LPCMP1_IRQHandler
VBAT_IRQHandler
Reserved91_IRQHandler
DefaultISR
        B DefaultISR

        END
